# PDFExportOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PDFExportOptions Class
Members See Also
---
Options for PDF export
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022
# Syntax
C#
---
```text
public class PDFExportOptions : IDisposable
```

Visual Basic
---
```text
Public Class PDFExportOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class PDFExportOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..PDFExportOptions
# See Also
PDFExportOptions Members
Autodesk.Revit.DB Namespace